BAS BMEKZU Project/src/Catalogs/скEDI_Подписи/скEDI_Подписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>скEDI_Подписи</name>
  <owners>Catalog.скEDI_Организации</owners>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДРФО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>EnumRef.скEDI_РолиПодписей</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеКлюча</name>
    <type>
      <types>EnumRef.скEDI_ИспользованиеКлючей</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>email1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяПодписьШифрования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сертификаты</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьПриПриемеМассивомСертификатов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТелоСертификата</name>
      <comment>Base64-строка, построенная на основании двоичных данных файла сертификата</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаДействия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДействия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИздательСертификата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючНаЗащищенномНосителе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСекретногоКлюча</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючНаСервисеCloudKey</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/Enums/скEDI_ИспользованиеКлючей/скEDI_ИспользованиеКлючей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_ИспользованиеКлючей</name>
  <enumValues>
    <name>Подписание</name>
  </enumValues>
  <enumValues>
    <name>Шифрование</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/скEDI_Подписи/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	Если ОсновнаяПодписьШифрования Тогда
		Если ИспользованиеКлюча = Перечисления.скEDI_ИспользованиеКлючей.Шифрование Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	скEDI_Подписи.Ссылка
			               |ИЗ
			               |	Справочник.скEDI_Подписи КАК скEDI_Подписи
			               |ГДЕ
			               |	скEDI_Подписи.Ссылка <> &Ссылка
			               |	И скEDI_Подписи.Владелец = &Владелец
			               |	И скEDI_Подписи.ОсновнаяПодписьШифрования";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("Владелец", Владелец);
			ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
			Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
				ОрганизацияОбъект = ВыборкаРезультатаЗапроса.Ссылка.ПолучитьОбъект();
				ОрганизацияОбъект.ОсновнаяПодписьШифрования = Ложь;
				ОрганизацияОбъект.Записать();
			КонецЦикла;
		Иначе
			ОсновнаяПодписьШифрования = Ложь;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	//Отказ = Не МонопольныйРежим();
КонецПроцедуры
